Revit 2026 API

# PDFExportOptionsZoomType Property

---

Zoom type of either fit to page or on a specific percentage.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ZoomType ZoomType { get; set; }
```
```vb
Public Property ZoomType As ZoomType
	Get
	Set
```
```cpp
public:
property ZoomType ZoomType {
	ZoomType get ();
	void set (ZoomType value);
}
```
```fsharp
member ZoomType : ZoomType with get, set
```

#### Property Value

ZoomType

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

This property would be ignored if the PaperFormat is Default.

#### Reference

PDFExportOptions Class

Autodesk.Revit.DB Namespace